In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
df = pd.read_csv("C:/DIPython/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df['Age'].mean()

29.69911764705882

In [4]:
temp = df['Age'].fillna(df['Age'].mean())
temp.isnull().sum()

0

In [7]:
ages = [0, 15, 60, 120]
agerange = pd.cut(temp, ages, labels=['young','middle-aged', 'old'])
agerange.head()

0    middle-aged
1    middle-aged
2    middle-aged
3    middle-aged
4    middle-aged
Name: Age, dtype: category
Categories (3, object): [young < middle-aged < old]

In [8]:
df['AgeRangge'] = agerange

In [10]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeRangge
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,middle-aged
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,middle-aged
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,middle-aged
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,middle-aged
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,middle-aged

In [11]:
df['Survived'].groupby([df['Pclass'], df['AgeRangge']]).sum()

Pclass  AgeRangge
1       young            5
        middle-aged    128
        old              3
2       young           19
        middle-aged     67
        old              1
3       young           25
        middle-aged     93
        old              1
Name: Survived, dtype: int64

In [12]:
df['Survived'].groupby([df['Pclass'], df['AgeRangge']]).mean()

Pclass  AgeRangge
1       young          0.833333
        middle-aged    0.653061
        old            0.214286
2       young          1.000000
        middle-aged    0.413580
        old            0.333333
3       young          0.431034
        middle-aged    0.217290
        old            0.200000
Name: Survived, dtype: float64

In [13]:
df['Survived'].groupby([df['Pclass'], df['AgeRangge']]).count()

Pclass  AgeRangge
1       young            6
        middle-aged    196
        old             14
2       young           19
        middle-aged    162
        old              3
3       young           58
        middle-aged    428
        old              5
Name: Survived, dtype: int64